app/views/users/index.html.erb

    Users: <%= @users.length %> /
    <%= User.count %>
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
SELECT COUNT(*) FROM "users"