app/views/posts/index.html.erb

    Post: <%= @posts.length %> /
    <%= Post.count %>
---
SELECT "posts".* FROM "posts"