app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    # if current_user.active?
    if current_user.subscription_status != "active"
      @posts = Post.free
    else
       @posts = Post.all

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at", "premium") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "New premium post"], ["body", "very good content"], ["user_id", 2], ["created_at", "2023-01-20 22:40:56.445450"], ["updated_at", "2023-01-20 22:40:56.445450"], ["premium", true]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user
    respond_to do |format|
      if @post.save