app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
    def index
        #@pagy, @users = pagy(User.all.order(created_at: :asc))
        @q = User.order(created_at: :asc).ransack(params[:q])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
       @user = User.friendly.find(params[:id])